/**
 * Created by Moye on 2017-12-10.
 */
var mapData=[
    {"name":"葫芦门水库","value":[118.8700965012,26.2268253793,"水利","闽清",1135,0,2.59]},
    {"name":"水口坝下治理工程","value":[119.1378748575,26.1563181222,"水电","闽清、闽侯",0,0,27.19]},
    {"name":"莲花水库","value":[118.1586248257,24.7286161167,"水利","同安区",3358,0,8.64]},
    {"name":"枋洋水库","value":[117.7660589850,24.6315660294,"水利","长泰县",12300,1.2,23.55]},
    {"name":"九龙坑","value":[118.7779875364,34.5480826360,"水利","龙海县",1344,0,2.54]},
    {"name":"彭村水库","value":[118.2475437926,25.4973575292,"水利","德化县",7871,0.74,12.78]},
    {"name":"双溪水库","value":[117.7992611118,26.4018390021,"水利","沙县",2771,0.6,5.03]},
    {"name":"黄沙坑水库","value":[117.2087294938,26.3617015696,"水利","明溪",1768,0,2.47]},
    {"name":"兴头水库","value":[118.1969218037,26.1763877122,"水利","尤溪",2090,0.08,4.59]},
    {"name":"溪源水库","value":[117.3716230744,25.9477285476,"水利","永安",1510,0,3.79]},
    {"name":"王家洲水库","value":[118.5477988871,27.9234524069,"水利","浦城县",2093,0,2.85]},
    {"name":"五星桥水库","value":[117.7660589850,24.6315660294,"水利","延平",2328,0,3.3]},
    {"name":"长汀荣丰水库","value":[116.3641895214,25.8393948452,"水利","长汀县",1180,0,3.18]},
    {"name":"新罗坪坑水库","value":[117.0439342262,25.1041545770,"水利","新罗区",1611,0,4.05]},
    {"name":"宁德官昌水库","value":[119.5326903250,26.6664880988,"水利","蕉城区",2900,5,5.18]},
    {"name":"寿宁屏峰","value":[119.5112138364,27.4667906869,"水电","寿宁县",1510,3,3.8]},
    {"name":"莆田乌溪水库","value":[119.1228425172,25.4647096008,"水利","涵江区",2328,0,3.3]}
];
var jbqkData=[
    {value:77, name:'在建项目'},
    {value:16, name:'拟建项目'}
]
var gcsxData=[
    {value:32, name:'水利'},
    {value:2, name:'水电'},
    {value:2, name:'烟基'}
]

var lxxxData=[
    {value:17, name:'大中型水库'},
    {value:36, name:'小型水库'},
    {value:24, name:'防洪和引调水工程'}
]

var ymrsData=[
    {value:72, name:'1000人及以下'},
    {value:4, name:'1000-2000人'},
    {value:24, name:'2000人及以上'}
]

var yjxzsgltdData=[
    {value:54, name:'1000亩及以下'},
    {value:10, name:'1000-2000亩'},
    {value:13, name:'2000亩及以上'}
]

var cqfwData=[
    {value:33, name:'0m2'},
    {value:39, name:'50000m2及以下'},
    {value:5, name:'50000m2及以上'}
]

var ymazjttzData=[
    {value:57, name:'1亿及以下'},
    {value:14, name:'1-5亿'},
    {value:6, name:'5亿及以上'}
]